In [1]:
import sys
sys.path.append('..')

from data import Data

In [2]:
data_frame = Data()
data_frame.read_from_csv('username.csv')
data_frame.display()

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [3]:
data_frame.get_variable_types()

Username       object
 Identifier     int64
First name     object
Last name      object
dtype: object

In [4]:
data_frame.normalize_std(' Identifier')
data_frame.display()

    Username   Identifier First name Last name
0   booker12     0.975981     Rachel    Booker
1     grey07    -1.213542      Laura      Grey
2  johnson81    -0.579268      Craig   Johnson
3  jenkins46     1.081326       Mary   Jenkins
4    smith79    -0.264496      Jamie     Smith

In [5]:
data_frame.reset()
data_frame.normalize_q(' Identifier')
data_frame.display()

    Username   Identifier First name Last name
0   booker12     1.000000     Rachel    Booker
1     grey07    -0.407828      Laura      Grey
2  johnson81     0.000000      Craig   Johnson
3  jenkins46     1.067735       Mary   Jenkins
4    smith79     0.202393      Jamie     Smith